{"custom_id": "2025-09-23-T-072-S-00313", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- require crypto firms to be licensed by MAS\n- advise the public that crypto is not suitable for retail investors\n- promote awareness of potential fraudulent crypto schemes through MoneySense\n- warn the public about risks associated with crypto investments, such as rug-pulling and pump-and-dump schemes\n- encourage extreme caution among the public regarding investment in unknown and high-risk schemes", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-077-S-00294", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Monitor trends of cases filed against financial institutions for investment-linked policies (ILPs)\n- Ensure financial institutions demonstrate ILPs' suitability for clients\n- Require disclosure of key product information, including fees and charges by financial institutions\n- Implement special arrangements for vulnerable clients, including elderly customers with limited proficiency in English\n- Mandate call-backs to verify client understanding of ILPs' risks before sale\n- Strengthen consumer protection with new requirements from 29 December 2025, including presence of a trusted individual for vulnerable clients during sales\n- Take firm enforcement action against financial institutions for misconduct, with actions published as a deterrent\n- Propose a standardized product highlights sheet for ILPs to outline risks, features, fees, and exit procedures\n- Classify ILPs as complex products to alert investors of their risk-return characteristics\n- Provide vulnerable customers with financial advice when purchasing any complex products", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-004-S-00042", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Explain the SEHC management model and address concerns regarding the Government's role in overseeing SEHC operators and their relationship with stallholders.\n- Maintain oversight over SEHC operators to ensure compliance with requirements that balance patron needs and stallholder well-being.\n- Implement basic guidelines for tenancy agreement terms to safeguard stallholders' interests, including limiting open days and hours, and capping charges for contractual breaches.\n- Cap stall rentals to average independently-valued rents and provide discounted rent in the first two years of operation for SEHCs.\n- Require SEHC operators to offer at least one value meal at each stall as part of tender requirements to ensure affordable food options are available.\n- Encourage SEHC operators to create loyalty schemes and phone apps that offer discounts to loyal customers to increase footfall and support stallholders.\n- Conduct quarterly feedback sessions between SEHC operators and stallholders to foster communication and address areas for improvement in operations.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-004-S-00048", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- NEA has established specific guidelines for tenancy agreements in NEA hawker centres that operators must follow, which includes flexible conditions for stallholders to make commercial decisions.\n- Clarify that hawkers should not be expected to make a loss on value meal requirements set between $3.00 and $3.50 per meal.\n- Recognize that stallholders have the autonomy to agree to the terms of the 'Pay It Forward' initiative based on their business decisions and operational considerations.\n- Acknowledge that value meals constitute only 5% to 20% of a hawker's sales, indicating that these are not designed to create business losses.\n- Emphasize that operators must reinvest 50% of their operating surplus to enhance traffic to hawker centres, benefitting the stallholders.\n- Highlight the government's financial contribution towards the construction and maintenance of hawker centres, which absolves operators and stallholders from these costs.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-015-S-00110", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- establish a town sports centre with a gym in Urban Redevelopment Authority's planning areas that have populations above 130,000\n- continue to review different formats for gym facilities as part of the Sports Facilities Master Plan", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-015-S-00107", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Maximize access to gym facilities in ActiveSG gyms - Ensure sufficient space and time for each user to exercise - Comply with prevailing fire safety requirements in gym facilities - Review peak capacity of ActiveSG gyms from time to time - Plan for at least one gym in every residential town within the town's ActiveSG Sport Centre - Expand existing ActiveSG gyms during renovation or redevelopment of sport centres - Monitor demand when planning supply of gym facilities", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-010-S-00082", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Enhance the ScamShield helpline with the ability to navigate the Interactive Voice Response System in all four official languages by 2026.\n- Provide multilingual materials to educate the public on scams and anti-scam resources, including an anti-scam resource guide in all four official languages.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-010-S-00085", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- enhance support for seniors through initiatives coordinated with the National Crime Prevention Council\n- deliver the discussed initiatives by 2026\n- promote the ScamShield suite of options as resources for seniors, including a website, app, and helpline\n- allow seniors to request helpline operators to speak more slowly", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-011-S-00090", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- assure that 50 infants is a good start for the pilot infant care program\n- enhance public awareness of childminding as an option for residents\n- stay open to feedback from parents and refine the pilot infant care program with operators", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-011-S-00087", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the launch of a Childminding Pilot for Infants to grow childminding services for infants aged two to 18 months as an additional caregiving option for parents\n- analyze and respond to demand for childminding services from parents and enhance service delivery\n- improve the efficiency of matching families with childminders", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-003-S-00020", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Investigate fake bulk order scams thoroughly.\n- Publicize details and conclusions of investigations when in the public interest.\n- Acknowledge the re-emergence of fake bulk order scams since May 2025, including impersonation of SAF personnel and teachers.\n- Report at least 45 cases of fake bulk order scams to the Police over the last four months, including six related to SAF personnel.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-003-S-00017", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- businesses should verify the identities of individuals they transact with\n- businesses can request orders from supposed Government officials to be sent via official email ending with 'gov.sg'\n- businesses should consult the Singapore Government Directory for contact details of relevant agencies when in doubt\n- businesses should check for supplier reviews to establish legitimacy before purchase\n- businesses should consider paying only upon delivery of goods\n- businesses can check the legitimacy of suspicious messages, phone numbers, and website links using the ScamShield app or the helpline at 1799", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-003-S-00014", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Take a tough stance against scammers and their mules, including potential imprisonment of up to 10 years for those facilitating scams.\n- Increase public education efforts to raise awareness of scams among businesses and the public.\n- Engage with industry stakeholders, such as the Food and Beverage Management Association Singapore, to share information on the telltale signs of scams and preventive measures.\n- Urge businesses to verify identities of individuals they transact with and to avoid advance payments or deposits with new suppliers.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-004-S-00109", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the professionalism and commitment of police officers\n- enhance technology adoption to improve police processes and efficiency\n- optimize manpower allocation for police assignments based on priority areas", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-004-S-00069", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Establish procedures for prioritizing missing vulnerable persons, particularly children, regardless of how long they have been missing.\n- Conduct regular case review sessions to monitor and guide investigations, especially for cases involving vulnerable individuals.\n- Collaborate with other Government agencies and utilize data sharing to locate missing persons effectively.\n- Enhance internal controls for case follow-ups through daily reviews and supervision throughout investigations.\n- Provide specialized training for frontline officers to handle family violence and child abuse cases sensitively.\n- Form Family Violence Teams to focus on family violence cases, including child abuse, with specialized training for officers.\n- Activate MSF's Domestic Violence Emergency Response Team for immediate interventions in high-risk cases involving domestic violence.\n- Empower Family Violence Teams to issue Emergency Orders for victim safety under the Women's Charter.\n- Use technology to implement automatic notifications for time-sensitive tasks for Investigation Officers.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-013-S-00100", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- encourage the public to use QR code clearance for faster border processing\n- ensure checkpoint operations are smooth and enhance the traveller experience\n- balance operational efficiency with border security", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-014-S-00105", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- implement public education campaigns for motorcyclists on road safety\n- enhance licensing requirements for motorcyclists\n- increase penalties for traffic violations involving motorcyclists\n- install roadside reminders to promote safe riding practices\n- enforce traffic regulations to ensure motorcyclist safety\n- promote the use of high-standard motorcyclist helmets\n- introduce ABS as a safety standard for motorcycles\n- review and adopt new technologies for motorcyclist safety", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-014-S-00102", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- raise penalties for speeding to reduce accidents\n- set zero tolerance as a benchmark to prevent accidents completely\n- enhance road safety standards for motorcyclists with updated helmet regulations effective from 1 November 2025\n- require newly registered motorcycles to have Anti-Lock Braking System (ABS) effective from 1 April 2027\n- run public education campaigns aimed at the riding community, such as the Singapore Ride Safe campaign and the \"Reward the Sensible Motorist\" initiative", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-05-T-016-S-00028", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- strengthen environmental sustainability efforts and climate adaptation plans\n- develop Singapore’s inaugural National Adaptation Plan (NAP) to enhance climate resilience\n- create a whole-of-Government integrated strategy for heat resilience in partnership with businesses, academia, and community\n- increase investments in science and technology for innovative solutions to manage heat effects\n- conduct site-specific studies for coastal protection measures against rising sea levels\n- enhance food supply resilience by diversifying food import sources and building stockpile of essential items\n- support local agri-food industry to become more productive and climate-resilient\n- commit to achieving net zero emissions by 2050\n- administer a carbon tax as a key enabler for decarbonisation\n- develop mitigation measures including a carbon credits market and carbon capture solutions\n- invest in assessing the safety of nuclear energy options and enhance incident response capabilities\n- plan long-term investments in water infrastructure to meet doubling demand by 2065\n- reduce waste disposal and improve recycling through industry collaboration\n- launch a Beverage Container Return Scheme in partnership with the beverage industry\n- improve public hygiene by targeting littering and rat issues with technology and enforcement\n- invest up to $1 billion to upgrade hawker centres and build new ones over 20 to 30 years\n- harness artificial intelligence and data analytics to improve operations for Singaporeans\n- support community and corporate initiatives for sustainable lifestyles through programmes like SG Eco Fund and Go Green SG", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-008-S-00093", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- involve training for senior officers\n- implement automation to assist staff in managing contract requirements\n- prioritize speed of implementation in reforms based on audit findings\n- run a tighter operation without compromising agency effectiveness", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-008-S-00102", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- investigate the accuracy of rates used in variation orders\n- hold assessment pending the outcome of the investigation\n- find that facts in altered documents were not misrepresented\n- conclude that there was no financial or operational suffering for the agency\n- decide on reprimanding and downgrading performance grade as the right outcome for staff involved in alteration", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-008-S-00105", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- ensure appropriate action is taken against contractors if investigation shows intention to defraud\n- review contractors periodically to assess their ability to supply and support agency operations", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-008-S-00099", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- improve clarity in operational processes within PUB\n- utilize technology to automate operations and reduce human error", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-008-S-00090", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Conduct comprehensive internal investigations into contract management lapses.\n- Report potential fraudulent practices to the Police for investigation.\n- Implement disciplinary actions if wrongdoing is uncovered during investigations.\n- Strengthen contract management processes by increasing the scope of internal audits on procurement.\n- Utilize digital tools, including AI, to improve checks on contractual requirements and detect fraud.\n- Tighten Standard Operating Procedures (SOPs) for contract management to ensure alignment with contractual requirements.\n- Require submission of original Certificates of Analysis (COAs) for compliance verification.\n- Automate processes where feasible to reduce reliance on manual monitoring and mitigate the risk of human error.\n- Share lessons from AGO findings with staff as part of regular training on procurement and contract management.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-008-S-00096", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- assure water safety and security\n- apply appropriate technology in operations and procurement\n- innovate in operational effectiveness to relieve officers from mundane tasks and focus on strategic functions", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-055-S-00315", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Conduct independent investigation into incidents under the Building Control Act by BCA\n- Convene internal investigation panel by MSE to prevent future incidents\n- Perform safety assessment checks on roads around sinkhole in consultation with BCA and Land Transport Authority", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-089-S-00394", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- relax policy to allow stallholders at hawker centres to hire Long Term Visit Pass (LTVP) or Long Term Visit Pass-Plus (LTVP+) holders as stall assistants without familial ties\n- monitor number of LTVP or LTVP+ holders working in hawker centres", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-090-S-00396", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- conduct regular inspections to ensure stallholders personally operate their stalls\n- issue termination notices to stallholders who do not comply with personal operation requirements\n- facilitate succession of hawker stalls through the Hawkers Succession Scheme (HSS)\n- match retiring veteran hawkers with aspiring successors for apprenticeship and stall transfer", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-017-S-00199", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Allocate 99 incubation stalls to aspiring hawkers under NEA's Incubation Stall Programme.\n- Offer reduced stall rental for 15 months to support aspiring hawkers.\n- Extend 50% rental discounts from six to nine months and provide 25% rental discounts for an additional six months to help participants stabilize their operations.\n- Conduct regular reviews of the Incubation Stall Programme to ensure relevance to hawker trade and needs of aspiring hawkers.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-065-S-00298", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Households can claim $400 in Climate vouchers under the Climate Friendly Households Programme (CFHP) to lower the upfront cost of resource-efficient appliances and fittings.\n- The vouchers can be used for purchasing 10 eligible resource-intensive household products, including refrigerators and washing machines.\n- HDB's Single Room Shared Facilities are equipped with energy and water-efficient appliances and shared facilities to reduce tenants' need to purchase their own appliances.\n- The National Environment Agency will periodically review the enhanced CFHP, including its coverage.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-091-S-00351", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- introduce extended producer responsibility schemes for priority waste streams\n- implement food waste segregation for large commercial and industrial food waste generators\n- enhance the National Recycling Programme by increasing the collection frequency for recyclables\n- launch a beverage container return scheme for plastic and metal beverage containers next April\n- explore ways to reduce contamination and improve the recycling rate\n- continue public education and outreach efforts through the Recycle Right campaign\n- trial source-segregated recycling via smart recycling bins with community partners\n- co-locate dedicated recycling bins in malls and Housing and Development Board void decks\n- strengthen support for paper recycling", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-022-S-00160", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Take a risk-based approach in regulating food businesses.\n- Do not require home-based food business owners to complete the Workforce Skills Qualification Food Safety Course Level 1 due to low food safety risks.\n- Encourage home-based food business owners to complete the Workforce Skills Qualification Food Safety Course Level 1.\n- Regularly review the food safety regime to ensure regulations are adequate and effective in managing food safety risks.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-071-S-00262", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- closely monitor the implementation of the Pulau Tekong polder to draw insights for future land reclamation projects\n- review the viability of using the empoldering method for future land reclamation projects\n- ensure soil improvement works are completed upfront for polder land readiness for building development", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-072-S-00264", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- No plans to expand the five-metre buffer distance for smoking restrictions.\n- Smoking is restricted to Designated Smoking Areas in smoking-prohibited places like Orchard Road No Smoking Zone.\n- Prohibit smoking in places such as covered and underground pedestrian walkways, playgrounds, and void decks.\n- Continue to review policies on smoking prohibition periodically.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-101-S-00322", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- anticipate gradual increase in household electricity consumption due to factors like induction cooking and higher air-conditioner usage\n- expect continued decrease in household water consumption with adoption of efficient water fittings and appliances", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-104-S-00328", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- continue to monitor regional seismic developments through the Meteorological Service Singapore (MSS)\n- maintain and review the building safety framework to ensure infrastructure resilience\n- work with research institutes such as the Earth Observatory of Singapore to deepen understanding of regional seismic occurrences and update risk assessments", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-061-S-00260", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- increase collection frequency of recyclables to three times a week\n- introduce larger capacity recycling bins in areas with high amounts of recyclables\n- address overflowing recycling bins caused by unflattened bulky items and festive cleaning increases\n- encourage public participation in proper recycling practices by flattening cardboard boxes and cleaning recyclables before disposal", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-063-S-00264", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- encourage responsible pet ownership\n- promote civic-mindedness among pet owners\n- urge pet owners to clean up pet urine to maintain public hygiene\n- support educational efforts by the National Environment Agency and the National Parks Board to inform pet owners about responsibilities", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-066-S-00270", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- co-fund Equatic's demonstration project for ocean-based carbon dioxide removal (OCDR)\n- validate the potential of OCDR technology for integration into PUB's desalination plants\n- contribute to Singapore's journey towards net-zero emissions", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-029-S-00169", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support local food production to achieve the \"30 by 30\" vision\n- enhance the capability and capacity of the local agri-food sector\n- provide support for farms through initiatives like the National Broodstock Centre and Hatchery Development and Recognition Programme\n- increase demand for local produce to help farms achieve scale\n- review local production strategies as part of a food supply resilience strategy", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-044-S-00202", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Require all fish farms to meet production targets to ensure sustainable food production\n- Encourage and support the adoption of technology in farming through the Agri-Food Cluster Transformation Fund\n- Strengthen biosecurity in farms to prevent and control diseases through the Aquatic Animal Health Services\n- Regularly engage with fish farms to understand their needs and provide appropriate support", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-073-S-00262", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- develop a local talent pipeline for the sea-based fish farming sector through partnerships with Institutes of Higher Learning\n- launch a Specialist Diploma in Aquaculture Management and Technology in collaboration with Temasek Polytechnic\n- facilitate job matching for local talents in the agri-food sector in partnership with WorkForce Singapore and the Employment and Employability Institute\n- support farms in achieving resource-efficient and climate-resilient food production\n- provide funding for farms to upgrade capabilities and adopt new technology through the Agri-Food Cluster Transformation Fund\n- strengthen farms' biosecurity to prevent and control diseases through the Aquatic Animal Health Services", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-078-S-00272", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- establish CAWRAS to advance tropical climate and weather research for Singapore and Southeast Asia\n- leverage high-resolution modelling and artificial intelligence to improve weather forecasting accuracy and timeliness\n- provide the public with more timely and accurate weather forecasts to enhance decision-making for outdoor activities\n- empower agencies with weather data to proactively mitigate weather-related risks\n- improve operational safety and efficiency in air traffic management and maritime sectors\n- mitigate risks to military servicemen from adverse weather during training exercises", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-097-S-00310", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Upgrade older hawker centres with ageing infrastructure into more vibrant, accessible and climate-resilient spaces.\n- Implement insights from the Hawker Centres Transformation Programme (HTP) in the Hawker Centres Upgrading Programme 2.0 (HUP 2.0).\n- Explore solutions to improve air circulation and ventilation in hawker centres.\n- Enhance cleaning and maintenance ease in hawker centres.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-098-S-00312", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- enhance commercial viability of sea-based fish farms through capability and capacity building initiatives\n- strengthen biosecurity of farms to prevent and control diseases\n- support farms in upgrading capabilities and adopting technology through the Agri-Food Cluster Transformation Fund\n- ensure farms are highly productive, climate-resilient, and resource-efficient to be commercially viable\n- increase productivity of the sector from 38.6 tonnes per hectare per year in 2023 to 40.7 tonnes per hectare per year in 2024", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-072-S-00338", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Work with farmers and retailers to facilitate long-term commercial contracts for local produce.\n- Provide greater certainty of demand and pricing for farmers.\n- Ensure retailers and food businesses have access to a reliable supply of good quality local produce.\n- Sell locally farmed vegetables and seafood at major supermarkets under branding initiatives.\n- Expand the range of aggregated local vegetable and seafood produce for sale at retailers.\n- Introduce locally farmed marine tilapia to the local dining scene through partnerships with restaurants.\n- Promote local farms and their produce through pop-up events like the SG Farmers' Market.\n- Drive demand for local produce to enhance food security in Singapore.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-083-S-00360", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- spend about $150 million on drainage upgrading projects in FY2025 to protect against flooding\n- completed four drainage projects and commenced work on three out of six projects slated for 2025\n- spend about S$2.5 billion since 2011 on drainage infrastructure\n- complete review of drainage infrastructure plan for FY2026 to FY2030 to identify key projects for the next five years", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-118-S-00430", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- prohibit smoking in common areas within residential buildings, including rooftop gardens connected to these buildings\n- consider suggestions regarding smoking regulations on rooftop gardens above multi-storey car parks as part of the review of smoking prohibition regulations", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-119-S-00432", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Enforce existing food safety regulations to ensure home-based food businesses sell safe food.\n- Take enforcement action against home-based food businesses selling unsafe food.\n- Do not impose additional fire safety requirements on small-scale home-based food businesses beyond residential setting standards.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-026-S-00206", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Complete site-specific studies for the north-west coast by 2026.\n- Commence site-specific studies for the south-west coast in 2026.\n- Complete studies for the south-west coast and Jurong Island by 2030.\n- Conduct studies for the North and North-east coast later.\n- Carry out preliminary and detailed designs of recommended measures post-study completion.\n- Commence construction of measures in the 2030s.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-039-S-00233", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- implement segregated waste collection for e-waste starting in 2021\n- implement segregated waste collection for food waste from large industrial and commercial buildings in 2024\n- implement segregated waste collection for beverage containers in 2026\n- review and implement segregated waste collection to complement the National Recycling Programme\n- appoint Public Waste Collectors (PWCs) through open tenders for waste collection across geographical sectors in Singapore, open to all qualifying companies", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-059-S-00275", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- require accreditation of overseas sources of high-risk food products before importation\n- monitor overseas sources of high-risk food products regularly after accreditation\n- maintain an inspection regime to test for food safety along the supply chain including at the point of import\n- reject or recall unsafe food products from the market\n- register and verify medicines by the Health Sciences Authority (HSA) to ensure they meet international standards and Good Manufacturing Practice requirements\n- conduct risk-based sampling of marketed medicines to ensure they meet required standards\n- implement a national adverse reaction monitoring programme to detect safety issues in medicines\n- take swift regulatory actions by SFA and HSA to protect public health and safety of food and medicinal products", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-065-S-00287", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- implement efforts to holistically reduce the amount of food waste generated\n- improve food waste recycling, including segregation of food waste from large industrial and commercial generators\n- encourage community partners to trial the collection of segregated food waste from households\n- seek support from all stakeholders to sustain household food waste segregation initiatives\n- support promising ground-up initiatives to manage food waste\n- review measures and explore ways to reduce food waste from domestic premises", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-069-S-00295", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the growth of local farms and raising their productivity through the adoption of technologies\n- promote awareness of the benefits of local produce among the community through initiatives in collaboration with the Ministry of Education", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-115-S-00387", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- take a firm stance against subletting to prevent rent-seeking behavior\n- conduct regular inspections of stallholders to ensure compliance\n- issue warnings to stallholders not personally operating their stall\n- issue termination notices to recalcitrant stallholders who fail to comply\n- bar recalcitrant stallholders from renting other hawker stalls\n- encourage stallholders and the public to report subletting activities\n- maintain a robust and transparent stall allocation system through open bidding\n- monitor bids closely to identify anomalies\n- inform prospective tenderers that they must personally operate their stalls and are not allowed to sublet\n- clearly state restrictions on subletting in the tenancy agreement between NEA and stallholders", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-088-S-00356", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support the growth of local farms and increase their productivity through technology adoption.\n- Collaborate with the Ministry of Education to raise awareness on the benefits of local produce among the community.\n- Promote educational initiatives in schools focused on food security and supporting local produce.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-134-S-00448", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Ensure compliance with regulatory noise limits at construction sites - Monitor construction sites for noise violations - Enforce penalties for non-compliance with noise regulations", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-019-S-00319", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- partner with Institutes of Higher Learning and local farms to develop Pre-employment Training (PET) and Continuing Education and Training (CET) programmes for the agri-food sector\n- equip students and adult learners with skillsets for meaningful careers in the local agri-food sector\n- give polytechnic students structured internship opportunities in the agri-food sector\n- build cross-disciplinary skills in graduates to enhance adaptability and employment opportunities", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-026-S-00333", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- implement right-pricing of water to reflect full costs of supply and production\n- encourage water conservation among all users, including the non-domestic sector\n- mandate large water users to submit annual Water Efficiency Plans to identify water-saving opportunities\n- introduce mandatory water efficiency requirements for new projects in specific industries with high water consumption, including a minimum 50% recycling rate in the wafer fabrication sector\n- impose penalties for non-compliance with mandatory water efficiency measures\n- support companies in managing water demand through incentives and grants from PUB's Water Efficiency Fund\n- develop sectoral water efficiency benchmarks and best practice guides to improve performance\n- recognize exceptional achievements in water efficiency through the Singapore Watermark Awards", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-051-S-00385", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Pilot commercial urban farming in Multi-Storey Car Park (MSCP) sites is limited with only seven farms remaining and overall production contributing less than 1% of local production in 2024.\n- Employment outcomes from MSCP urban farms are limited and profitability is low.\n- Local production through MSCP urban farms allows for community engagement activities where there is interest.\n- Address disamenities like noise and odour by investigating feedback and implementing mitigating measures with farm operators.\n- No plans to launch new tenders for commercial farming at MSCP sites, encouraging participation in SFA's land and sea space tenders instead for more space and longer leases to enhance local production and food security.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-096-S-00477", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Implement EPR schemes to strengthen producer responsibility\n- Focus on e-waste management through EPR, implemented in 2021\n- Introduce Beverage Container Return Scheme for beverage containers next year\n- Support proper management of textile waste\n- Encourage reducing, reusing, and recycling as a shared responsibility", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-101-S-00487", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- introduce the Disposable Carrier Bag Charge\n- implement the Beverage Container Return Scheme in 2024\n- reduce the amount of plastic waste disposed of through the Resource Sustainability Act and the Zero Waste Masterplan", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-045-S-00258", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Collaborate with Town Councils to issue advisories to residents regarding high-rise littering\n- Deploy surveillance cameras to capture violations of high-rise littering, if feasible\n- Enforce the statutory presumption provision on littering from residential flats that places greater responsibility on flat owners and tenants\n- Impose fines for high-rise littering of up to $2,000 for first convictions, $4,000 for second convictions, and $10,000 for third and subsequent convictions\n- Apply Corrective Work Orders requiring offenders to clean public areas for up to 12 hours\n- Consider individual assessment of repeat offences, including valid mitigating factors such as mental health conditions\n- Provide support and implement preventive measures like wire mesh installation for repeat offenders", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-071-S-00311", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- reference World Health Organization's guidelines for setting noise limits on construction and factory noise\n- enforce strict actions against noise limit violations\n- review the approach on noise management with agencies and industry stakeholders\n- explore ways to reduce noise impact from construction sites and factory premises", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-05-T-003-S-00014", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-002-S-00097", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Implement a scheme for development value to trainees that may transition from temporary to permanent based on specific milestones or indicators.\n- Consider local startups and companies as host organisations for offering development value to local graduates.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-002-S-00016", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- address variations in practices among insurance companies regarding Extended Panel benefits - ensure consumer access to care by evaluating insurance pre-authorisation policies", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-006-S-00081", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- acknowledge traditional beliefs in mental health treatment for the Malay/Muslim community\n- integrate modern practices in mental health care\n- create inclusive discussions on mental health support that respect religious and cultural values\n- encourage open conversations to reduce stigma around mental illness\n- provide integrated mental health services that are easily accessible\n- support one another in mental health concerns\n- recognize mental health as equally important as physical health in the Indian community\n- address stigma surrounding mental health within the Indian community\n- advocate for seeking help from professionals like doctors and counselors when needed", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-006-S-00082", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- advocate for mental health as a critical component of overall health\n- promote accessible, high-quality clinical care and a supportive community for mental health\n- integrate mental health screening into the wider community health framework, similar to Healthier SG\n- adopt a \"no wrong door policy\" for mental health disorders, ensuring coordination among agencies\n- create safe community spaces for residents to share concerns and access timely help\n- implement mental health interventions in a phased and sandboxed approach to assess effectiveness", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00016", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- inquire about data on appeals for the SkillsFuture Mid-Career Training Allowance from individuals aged 40 and below\n- suggest studying data on appeals to better support individuals aged 40 and below beyond just SkillsFuture", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-013-S-00102", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- provide information on sectors for better career transitions for learners and employers\n- track and publish outcomes for sectors with higher sample sizes based on current matrices", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-002-S-00026", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- consider mental health assessment as part of the pre-employment assessment for MDWs in future", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-016-S-00155", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support CareShield Life and Long-Term Care (Amendment) Bill for its role in safeguarding against long-term financial impacts of severe disability.\n- Suggest transitional enrolment mechanism for long-serving residents who attain citizenship or permanent residence later in life, aimed at including those with pre-existing conditions.\n- Propose automatic base-tier eligibility for dementia patients under CareShield Life based on clinical diagnosis, to reduce delays and provide peace of mind to caregivers.\n- Advocate for inclusion of mid- to severe-level mental illnesses within CareShield Life coverage parameters, determined by formal psychiatric assessments.\n- Recommend creation of a unified online platform for caregivers to manage eligibility and claims processes more efficiently.\n- Urge deeper integration of CareShield Life with AIC, Silver Support, and Healthier SG initiatives to better support caregivers and families within the care system.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-002-S-00048", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Set up frameworks to engage parents for clearer communication guidelines\n- Establish shared communication platforms for parents to voice concerns about their children\n- Implement further measures to enhance parent-teacher communication", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-005-S-00043", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- inquire about detection of other unlawful or harmful substances beyond etomidate-laced vapes\n- explore in-house suspensions within schools for better student rehabilitation", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-001-S-00026", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- ensure timely communication with parents regarding bullying incidents in schools\n- provide continuous support to parents in addressing bullying issues\n- keep parents informed about the progress and efforts made by teachers and schools to handle bullying", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-018-S-00143", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support the development of a family-friendly and senior-friendly live, work, learn, and play hub in the northern parts of Singapore.\n- Advocate for the transformation of the north into a modern and vibrant regional centre.\n- Support the commencement of Johor Bahru-Singapore Rapid Transit System Link operation to improve connectivity with Malaysia.\n- Endorse the expansion of the Woodlands Checkpoint to reduce traffic congestion and enhance security.\n- Propose the redevelopment of Kranji race course into a major housing development project.\n- Recommend retaining state-of-the-art facilities from the Sports School for conversion into a recreational hub instead of replacing it with more housing.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-015-S-00128", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- suggest issuing a guidance note to unify the expectations of Certificate Issuers from doctors and lawyers to ensure consistency in standards and minimize disputes regarding LPAs\n- commend community partners for organizing law awareness talks to increase LPA awareness among minority groups\n- suggest increasing emphasis on the importance of comprehensive estate planning, including LPAs and wills, to improve take-up rates", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-015-S-00130", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- enhance the legacy portal to improve take-up rate\n- extend the waiver of the registration fee for Form One beyond 31 March 2026 in light of remote certifications", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-015-S-00113", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the Electronic Conveyancing and Other Matters Bill\n- appreciate the objectives behind the introduction of the Digital Conveyancing Platform (DCP) to streamline the conveyancing process, enhance convenience and minimize clerical errors\n- seek clarification on the take-up rate for DCP and buy-in from stakeholders such as real estate agents, property developers, and banks\n- suggest that transactions involving Government agencies, such as HDB and the CPF Board, should lead in using DCP\n- recommend that the Singapore Academy of Law sunset current escrow fee arrangements to merge them into the DCP framework\n- recommend that SLA partner with law institutions to organize workshops for training stakeholders in DCP skills\n- inquire if the virtual execution of deeds on PETS will satisfy current legal requirements of the Conveyancing and Law of Property Act (CLPA) regarding Powers of Attorney\n- ask the Government how it will assure stakeholders, particularly SMEs and the elderly, of the safety and security of DCP against scams and cybersecurity threats", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-002-S-00039", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- emphasize the need for teacher appraisal and progression to include non-teaching duties such as projects and CCAs\n- advocate for gathering teachers' feedback on demands from students' parents\n- support the implementation of a mentorship scheme between senior and junior teachers to encourage support for young educators", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-004-S-00098", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Require parents of affected children to be informed by relevant agencies in cases of potential child abuse\n- Involve both parents in any safety plan regarding child abuse, regardless of their marital status", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-001-S-00016", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Consider taking prevailing food supply prices into account in collaboration with the Ministry of Trade and Industry.\n- Mitigate operating costs for merchants and hawkers to protect them from sudden price surges in food items.\n- Address the concern of escalating costs of living due to increased prices of protein items affecting consumers.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-007-S-00060", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- track carbon footprint reductions during CGS Day celebrations\n- set targets for energy waste reduction efforts in the community\n- cultivate greater interest and involvement of Singaporeans in CGS objectives", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-009-S-00157", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- emphasize the importance of the Malay community coming together and viewing identity as a strength - reject victimhood in the context of identity politics", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-009-S-00145", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Emphasize the importance of believing in serving everyone and that Singapore is for all.\n- Stress the significance of peace and harmony as important tenets of society.\n- Call for clarifications on the timing of discussions about race and religion in electoral politics.\n- Advocate for ensuring a safer space for minority voices to speak up on discrimination.\n- Promote the idea of having tough but meaningful conversations on race and religion while preserving mutual respect.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-009-S-00154", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Emphasize unity among different communities in Singapore as a strength\n- Advocate for a collective Singaporean identity that transcends individual backgrounds\n- Promote the idea of serving Singapore together rather than feeling victimized by specific intentions or targets", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-016-S-00174", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- inquire about data on gender differentiation in insurance claims related to disability and health\n- advocate for gender neutral premiums in insurance schemes, where necessary adjustments would lead to men paying more and women less", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-001-S-00010", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- consider the impact of upcoming BTO and condominium projects on congestion when deciding whether to continue the programme\n- evaluate the consequences of achieving or not achieving the 7% shift from the previous project in 2013", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-013-S-00169", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support the Bill for workplace discrimination and provide clear steps for employees to seek recourse against employers.\n- Propose the establishment of a specialised office to provide legal information and advice to aggrieved workers.\n- Advocate for the development of a legal clinic focused on workers' rights and employment law.\n- Emphasise the need for education and awareness campaigns to empower workers under the Workplace Fairness Act.\n- Request confirmation that employees will be entitled to have support persons accompany them during mediation and ECT hearings.\n- Call for support mechanisms for workers who struggle with English or digital literacy to help submit claims and navigate procedures.\n- Recommend accommodations for workers with disabilities at all stages of the dispute resolution process under the Act.\n- Suggest allowing workers who have experienced both workplace discrimination and harassment to have their claims heard together before the ECT.\n- Propose that the requirement for mandatory mediation be reconsidered for cases where it may cause re-traumatisation of workers.\n- Recommend trauma-informed training for mediators, tribunal members, and judges to support aggrieved workers during the dispute resolution process.\n- Advocate for fast timelines for dispute resolution to reduce uncertainty and anxiety for workers pursuing claims.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-010-S-00173", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Call for an amendment to address serious harm needing immediate action through a reasonable grounds test for content takedown.\n- Advocate for the use of investigative powers in cases of ambiguous harm that do not meet the reasonable grounds threshold, allowing the Commissioner to determine the appropriateness of action.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00253", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Enhance the effectiveness of laws for victims of online harms through proposed amendments.\n- Provide careful consideration for the Bill's powers regarding online harms.\n- Support the notion that online harms legislation requires continuous review, refinement and development alongside technological changes.\n- Assert that the Broadcasting Act does not provide swift recourse for victims of online harms.\n- Advocate for explicit coverage of two categories of harmful online activity identified as egregious by respondents.\n- Recommend that victims lodge reports with OSC instead of IMDA for better redress opportunities.\n- Emphasize that OSC should have the ability to issue directions and orders rapidly for victim support.\n- Acknowledge that the new agency under the Bill has wider powers and more remedies available for victims.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00275", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00271", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Amend the definition of \"non-consensual disclosure of private information\" to consider public interest in the disclosure when it outweighs privacy concerns.\n- Include specific matters as examples of public interest in disclosure: informing the public on significant concerns, exposing wrongdoing or corruption, ensuring proper administration of government, promoting open justice, protecting public health and safety, addressing national security, and preventing serious crime or fraud.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00265", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Amend clause 3 to include provisions for the publication of online material encouraging or promoting suicide or an act of deliberate self-injury.  \n- Include sexual grooming of any person below 18 years of age or vulnerable adults as an actionable offense.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00289", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Establish an appeals process to the General Division of the High Court for decisions made by the Appeal Committee regarding online harmful activities.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00285", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- address sexual grooming of any person below 18 years of age or vulnerable adults through specific regulations relating to online communication\n- impose penalties for intentional communication of online material that encourages or provides instructions for sexual activity with minors or vulnerable adults\n- clarify definitions of key terms including 'sexual grooming', 'vulnerable adult', 'sexual communication', and 'sexual activity' in the context of the law\n- establish that consent from minors or vulnerable adults does not serve as a defense against charges of sexual grooming\n- include exceptions for communication with legitimate purposes related to science, medicine, education, or art, provided it does not pose undue risk to minors", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00281", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Propose legislation to regulate online material that encourages or promotes suicide or self-injury  \n- Exempt online communications with legitimate purposes related to science, medicine, education, or art, provided they do not pose an undue risk of harm to individuals below 16 years of age", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00297", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- require online service providers to provide publicly accessible information on risk assessments and trends relating to online harms\n- require online service providers to provide publicly accessible information on user privacy\n- require online service providers to outline clear procedures for reporting content and making complaints\n- require online service providers to detail measures taken to enable users to seek recourse for online harms\n- require online service providers to disclose time taken and remedies granted in response to reports and complaints", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00277", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00273", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Propose an amendment to clause 19 to clarify that communication of online material regarding public interest matters does not constitute \"online instigation of disproportionate harm\".", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00293", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Require the Commissioner to prepare and transmit an annual report to Parliament on online harmful activities and content.\n- Include specific categories in the report such as the number of complaints received, types of complaints, directions issued by the Commissioner, risk assessments and trends related to online harms, and accessibility of recourse for vulnerable adults.\n- Ensure the report addresses privacy concerns in accordance with the Personal Data Protection Act 2012.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-012-S-00269", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- amend clause 9 of the Bill to state that communication of online material is not considered online harassment if it constitutes fair comment on a matter of public interest", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-05-T-003-S-00006", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-003-S-00007", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-013-S-00134", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-014-S-00135", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- The Leader of the Opposition will have designated Parliamentary privileges, including seating directly across from the Prime Minister and the right to ask the first question among MPs on policies, Bills, and Motions.\n- The Leader of the Opposition will have an allocated speech time of 40 minutes for debates, longer than the usual 20 minutes for other backbenchers.\n- The Leader of the Opposition will receive staff support and resources, as well as a Parliamentary allowance that is double that of other MPs.\n- The Leader of the Opposition is responsible for leading and organising the Opposition’s Parliamentary business, presenting alternative views in debates, scrutinising the Government’s actions, and nominating opposition Members for appointments to Select Committees.\n- The role includes attending official state functions and receiving confidential briefings on national security and external relations issues from the Government.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-015-S-00137", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Grant the Leader of the Opposition Mr Pritam Singh the privilege to speak for up to 40 minutes on any question in Parliament until the end of the 15th Parliament.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-019-S-00213", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-028-S-00221", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- adopt a risk-based approach in audits\n- utilize digital tools and data analytics in procurement audits\n- develop tools to identify potentially fictitious documents\n- employ AI to identify higher-risk transactions and improve audit efficiency\n- share digital tools, risk indicators, and detection techniques with public agencies\n- trial emerging AI tools to enhance audit capabilities\n- explore the use of AI to strengthen financial governance, procurement, and contract management\n- share AI-powered anomaly detection tools across public agencies for fraud detection", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-030-S-00177", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Base interest rates of SSGS on CPF interest rates independent of GIC's returns.\n- Ensure CPF savings are invested entirely in risk-free SSGS issued by the Government.\n- Guarantee CPF savings and pay SSGS interest rates to CPF Board regardless of GIC's returns.\n- Pursue prudent fiscal policy to maintain a healthy buffer of net assets for risk absorption across market cycles.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-008-S-00072", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- take a holistic approach to determine Government support for cost of living\n- provide additional support for Singaporeans through Budget 2025, including CDC vouchers and U-Save rebates\n- strengthen structural social support in housing, healthcare, education and retirement\n- monitor economic conditions closely and adjust cost-of-living support as necessary\n- promote broad-based and inclusive real wage growth as the best long-term support for Singaporeans", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-008-S-00075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Assess needs based on data and real sentiment before providing support\n- Target support measures towards specific demographic groups, including seniors and lower-income families\n- Provide climate vouchers for both HDB and private housing dwellers\n- Implement support for childcare as a social purpose\n- Introduce SG60 vouchers to assist with cost of living and offer options for spending\n- Use SkillsFuture credits to encourage lifelong learning based on economic context", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-028-S-00192", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support Singaporean households with daily expenses through the CDC Vouchers Scheme  \n- provide targeted financial assistance at both household and individual levels  \n- offer household-level schemes like U-Save and S&CC rebates  \n- provide individual assistance through GST Voucher – Cash and MediSave and the Silver Support Scheme  \n- assess means for assistance based on various criteria including household income per person  \n- offer discretionary assistance schemes such as MediFund and ComCare for additional support  \n- regularly review support measures to ensure adequate assistance for all Singaporeans, particularly those from larger households", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-038-S-00212", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Ensure Temasek Holdings sets up three new wholly-owned entities to manage different portfolio segments.\n- Hold the Board of Temasek Holdings accountable for delivering good long-term returns on the investment portfolio.\n- Require Temasek to publish net returns of the total portfolio after deducting all investment fees and expenses.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-078-S-00296", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the take-up rates of Government-Paid Maternity Leave (GPML) and encourage its continued high utilization\n- promote the increase in take-up rates of Government-Paid Paternity Leave (GPPL) and childcare leave by fathers\n- make the additional two weeks of GPPL and 10 weeks of new Shared Parental Leave (SPL) mandatory\n- extend employment protections against unlawful dismissal of employees taking GPPL and adoption leave\n- protect employees from discrimination related to pregnancy and caregiving responsibilities under the Workplace Fairness Act\n- advocate for a whole-of-society approach that supports families and caregiving responsibilities\n- encourage businesses to invest in good HR practices that balance business efficiency with support for parent employees\n- cultivate a collaborative approach between employers and employees regarding parental leave planning", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-011-S-00063", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- invest in local workforce development\n- enhance the business environment\n- strengthen connectivity\n- foster a vibrant tech and innovation ecosystem\n- support the retention and attraction of international talent that complements local capabilities", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-011-S-00066", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Emphasize the importance of investment and development in local talent to improve competitiveness.\n- Advocate for raising public expenditure on education as a percentage of GDP to enhance rankings in international reports.\n- Highlight the need to focus on outcomes rather than just expenditure percentages in education to ensure value-for-money in educational investments.\n- Support initiatives like SkillsFuture to maintain high public expenditure on education per student.\n- Acknowledge the high-quality performance of Singapore's education system as reflected in international benchmarks like PISA.\n- Address perception-based indicators negatively impacting rankings, particularly on employee training and apprenticeships, to enhance competitiveness.\n- Recognize the need to improve factors affecting appeal such as worker retention and motivation, and address high living costs perception.\n- Maintain strong preparation of the workforce and focus on increasing the availability of skilled labour and expertise among the workforce.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-021-S-00153", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-26-T-082-S-00280", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- provide $1,000 each year in Large Family LifeSG Credits (LFLC) for each third and subsequent Singapore Citizen child, from age one to six\n- offer $500 in Child LifeSG Credits for Singapore Citizen children aged zero to 12 as part of Budget 2025\n- provide $500 in Edusave Account for children aged 13 to 16\n- provide $500 in Post-Secondary Education Account (PSEA) for children aged 17 to 20\n- continue to monitor and consider adjustments to the Large Families Scheme (LFS) where necessary", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-010-S-00097", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-010-S-00109", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-010-S-00091", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Clarify statements made by the Leader of the Opposition during parliamentary proceedings regarding the 'gate-crashing' of a meeting by Mr. Deros.\n- Seek confirmation from Mr. Singh regarding whether Mr. Deros gate-crashed the meeting and Mr. Faisal's awareness of Mr. Deros's attendance.\n- Highlight the need to address the claim that Mr. Deros is a 'nobody' and the potential implications of this statement, given Mr. Deros's public activities and connections with the WP.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-010-S-00113", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-010-S-00101", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-010-S-00105", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Clarify the terminology of 'gate-crashing' in the context of political meetings, questioning the appropriateness of the term as it may imply an uninvited presence when prior notice was given.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-029-S-00236", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Ensure eligible Singaporeans temporarily without fixed residential addresses are included in Government schemes.\n- Provide one set of Community Development Council (CDC) Vouchers per tranche for every Singaporean household based on their NRIC address.\n- Offer assistance at community centres for households that cannot claim their CDC Vouchers due to multiple households at one address or non-residential registered addresses.\n- Implement the enhanced Climate Friendly Households Programme to encourage adoption of energy- or water-efficient appliances by subsidizing eligible products.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-035-S-00248", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- expand the scope of CDA use to cover all preschool incidental charges as per ECDC Regulations 2018\n- provide financial support for preschoolers to enhance their learning opportunities in preschools\n- not open CDA funds for enrichment programmes offered outside of preschools\n- offer means-tested subsidies for lower-income families, including additional preschool subsidies\n- advise lower-income households to approach Social Service Offices for additional financial assistance", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-001-S-00002", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Conduct procurements in a fair manner", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-001-S-00005", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- distinguish between Autonomous Universities (AUs) and Government agencies, emphasizing AUs' independence\n- expect AUs to adhere to fundamental procurement principles of value-for-money, transparency, and open competition\n- recognise the need to support enterprises in current economic conditions while achieving value-for-money in public spending\n- implement limited liability for consultants in contracts as of December 2025\n- make payments to suppliers at specified project milestones, including the provision of guidelines for more frequent payments\n- introduce Tender Lite to simplify procurement processes for tenders up to $1 million, aiding SMEs\n- encourage collaborative contracting and fair clauses across the construction industry to promote win-win outcomes in contracts\n- assert that Government standard contracts should serve as a reference for fairness in procurement", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-004-S-00071", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-008-S-00115", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- tighten rules against misuse of companies for unlawful purposes\n- safeguard shareholders' interests through a two-tier approval process for selective off-market purchases\n- strengthen the regulatory framework for companies by increasing penalties for breaches of director duties\n- reduce regulatory burden on companies by abolishing minimum opening hours for registered offices\n- enhance accountability in auditing by requiring public accountants to be identified in audit reports", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-008-S-00121", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- review the corporate regulatory framework to reduce compliance costs for companies\n- remove the requirement for a company's registered office to be open for at least three hours every business day to give companies more operational flexibility\n- allow small companies to prepare financial statements using a simplified financial reporting framework\n- exempt companies from audit requirements if revenue, assets, and/or employees are below certain thresholds\n- continue to review compliance requirements for more companies to benefit from simplified frameworks or exemptions\n- enforce new requirements in a measured manner with sanctions proportional to the breach\n- implement measures to enhance personal data protection while maintaining corporate transparency, such as the filing of non-residential contact addresses", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-009-S-00124", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-011-S-00227", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-073-S-00430", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- take a long-term approach towards land use and infrastructure planning\n- ensure sufficient land to meet current and future needs\n- provide a high-quality living environment for all Singaporeans\n- consider changing demographic and socioeconomic trends in planning\n- respond to evolving needs and aspirations of Singaporeans with optimal use of physical space\n- incorporate urban design strategies such as varying building heights and creating well-connected and pedestrian-friendly public spaces", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-016-S-00115", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support cash assistance for parents through programs like Baby Bonus Cash Gift and First Step Grant\n- emphasize that a Baby Gift should be a commemorative gesture rather than a necessity\n- recognize that different parents have varying preferences for gifts and support flexibility in choosing assistance", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-016-S-00112", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- continue to review how to celebrate and support families\n- provide greater financial support for parents\n- offer flexibility in using the Baby Bonus Cash Gift ranging from $11,000 for the first and second child to $13,000 for the third and subsequent children\n- implement the Large Families Scheme to provide $1,000 of Large Family LifeSG Credits each year for every third and subsequent Singapore Citizen child from age one to six\n- promote marriage and parenthood and review policies to ensure relevance in supporting parents", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-018-S-00134", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- correct previous statement regarding Singapore's World Talent ranking improvement from 65th in 2024 to 63rd in 2025\n- acknowledge slight fall in perception-based indicators for education, yet emphasizing that rankings remain high with primary and secondary education at third and university education at seventh", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-034-S-00235", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Consider total fertility rate, life expectancy, and age profile for immigration intake decisions\n- Exclude citizenships granted by descent from total citizenship numbers to accurately reflect immigration inflows\n- Continue reporting citizenships by descent under the Marriage and Parenthood section of the Population in Brief", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-050-S-00268", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- note the 29,237 Citizen births in 2024, representing a 1.2% increase from 28,877 in 2023\n- acknowledge that the increase in Citizen births is primarily due to an increase in Chinese births\n- recognize that the dragon year effect in 2024 contributed to the increase in Chinese births\n- observe that the dragon year effect is diminishing over time, indicating a shift away from traditional beliefs in childbearing decisions\n- project that the total population will remain significantly below 6.9 million by 2030 based on current trends", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-017-S-00165", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support community-driven initiatives that connect seniors and youths\n- support the expansion of elder care services to foster community bonding\n- advocate for intergenerational activities in schools and public spaces\n- promote digital inclusivity for seniors to engage with online services\n- advocate for long-term funding for youth support programs\n- strengthen vocational tracks as primary options for youth\n- expand mentorship opportunities in various fields including trades and arts\n- emphasize the importance of building relationships and trust with youth\n- support initiatives that help marginalized youth realize their potential", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-005-S-00034", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- empower the SPF to apprehend individuals using or distributing vapes\n- address concerns regarding the adequacy of resources for HSA to tackle the surge in vaping cases", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-24-T-006-S-00088", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support prioritizing public transportation in a land-constrained nation like Singapore\n- advocate for recognizing the needs of individuals with disabilities, additional children, and elderly parents in public transportation policies over those purchasing additional cars", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-14-T-002-S-00031", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- seek to expand pharmaceutical exports to third markets", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-001-S-00021", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Seek to understand the pervasiveness of illegal ride-hailing services offered via chat groups and apps.\n- Propose a plan to crack down on illegal ride-hailing services, potentially using methods like 'secret shopper'.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-016-S-00142", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the proposed amendments to the CareShield Life and Long-Term Care Act \n- advocate for equitable treatment of all Citizens and Permanent Residents regarding enrollment in CareShield Life \n- emphasize a moral responsibility to care for those already disabled \n- call for a comparison of financial support for individuals with and without CareShield Life coverage \n- suggest the inclusion of more instrumental ADLs in disability assessments for CareShield Life coverage \n- propose a shift from a binary outcome in disability assessment to an index scoring approach \n- recommend extending the 'free-look' period for CareShield Life enrollment to three months \n- support the idea of allowing a one-year opt-out option for enrollees with a penalty \n- inquire about the proportion of participants receiving premium support and the process for accessing it \n- request clarification on whether CareShield Life will be administered by the CPF Board or a private insurer \n- urge that clear communication about coverage lapses comes from the CPF Board to maintain trust among policyholders \n- stress the importance of compassion in claims evaluation within the CareShield Life scheme", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-016-S-00186", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Clarify that using an index approach does not require expanding coverage to individuals with mild disabilities.\n- Support the use of a scoring system like the modified Barthel Index to determine the need for assistance in disability care.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-10-15-T-016-S-00183", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- request differentiation of gender data in CareShield and ElderShield\n- propose filing a Parliamentary Question to obtain gender data if it is unavailable\n- support the implementation of an index scoring approach (Katz Index or modified Barthel Index) to assess disability severity objectively", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-011-S-00089", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Address challenges in acquiring top end talent in nuclear science and engineering", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-019-S-00150", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Acknowledge the historical significance of private properties with national importance, like the Oxley property.\n- Support the careful weighing of public benefits against private property rights in decisions regarding the gazetting of properties as National Monuments.\n- Advocate for transparency in the evaluation process of public interest versus private preferences when considering eminent domain actions.\n- Suggest that the Government explore options which preserve the buildings while respecting the privacy of the current owner, including the possibility of restricting public access unless permission is granted.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-020-S-00189", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support the Multinational Enterprise (Minimum Tax) Act while expressing specific concerns about its legislative elements.\n- Emphasize the importance of clarifying definitions and rules related to the OECD's BEPS 2.0 project and Global Anti-Base Erosion (GloBe) Rules in Pillar Two.\n- Seek confirmation that GloBe reporting obligations will be imposed on securitisation entities that are often off-balance sheet.\n- Advocate for robust enforcement of arms-length pricing for Research and Innovation Credit (RIC) entities to prevent tax liabilities shielding.\n- Raise concerns about the effectiveness of BEPS in the absence of US participation and its implications for small countries like Singapore.\n- Assert that international tax rules will continue to evolve despite the US's pullback.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-022-S-00207", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- introduce Trade Information Certificates (TICs)  \n- expand the scope of search authority for customs officials  \n- empower traders, especially smaller ones, through targeted assistance", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00017", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- set the age cut-off for job assistance at 40 based on data on unemployment risks and re-employment duration\n- provide subsidies of up to 70%, potentially rising to 90% for employer-driven initiatives, for all Singaporeans\n- offer SkillsFuture Credit to all individuals above the age of 25\n- support lower-wage workers above the age of 30 with specific initiatives\n- promote various training opportunities available to Singaporeans of all ages, beyond SkillsFuture programs", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00014", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Emphasize the need for better matching and integration between training curricula and industry needs.\n- Advocate for collaboration between large employers, trade associations, and training providers to inform curricula and job roles.\n- Stress the importance of developing workers' confidence in the training process by aligning it with employer expectations.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00020", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support lifelong learning and reskilling opportunities throughout one's career rather than immediate utilization of SkillsFuture Credit.\n- Advocate for consideration of postgraduate support based on the demand for qualifications and relevance to individual outcomes.\n- Emphasize that SkillsFuture Credit can be used for Master's programs at autonomous universities, which align with niche areas of development.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00008", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- provide affordable and accessible broad-based training support through SkillsFuture Singapore\n- subsidise industry-relevant training programmes at up to 70% of course fees for all Singaporeans\n- offer $500 in SkillsFuture Credit for Singaporeans at age 25 to develop skills and interests\n- implement the SkillsFuture Level-Up Programme (SFLP) to help mid-career Singaporeans pursue skills reboot\n- provide SkillsFuture Credit (Mid-Career) top-up of $4,000 to lower out-of-pocket training costs\n- offer a SkillsFuture Mid-Career Training Allowance to offset income loss when pursuing full-time training\n- continue to curate SkillsFuture Level-Up courses to improve employability\n- expand the Level-Up Programme by providing training allowance for part-time long-form training from early next year\n- refresh and expand IHL full qualifications and SkillsFuture Career Transition Programmes to meet emerging skills needs\n- monitor training needs of adult learners throughout life stages\n- provide additional support to lower-wage workers in their 30s for upgrading to full qualifications\n- allow SkillsFuture Credit (Mid-Career) to be used for postgraduate training but not extend training allowance to postgraduate programmes\n- strengthen partnerships between Government, individuals, unions, industry and training institutions to encourage lifelong learning", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00023", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- encourage the use of $500 SkillsFuture Credit before its expiration\n- support the additional $500 opening Credit and the long-term $4,000 SkillsFuture Credit\n- promote lifelong learning and skill development during one's career\n- highlight the importance of utilizing SkillsFuture credits for courses\n- remind constituents about the expiration of the $500 SkillsFuture Credit by 31 December 2025", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-001-S-00011", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- ask employers to support the SkillsFuture movement more actively\n- increase the proportion of training places supported by employers under SkillsFuture\n- encourage employers to send workers for training to signal the importance of skills upgrading\n- promote lifelong learning culture as part of adult work\n- reduce workplace frictions to facilitate employee training and job transformation", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-013-S-00103", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- continue to study means to help learners, employers, and training providers make informed course selections\n- create opportunities for learners by guiding them towards valuable training programs\n- develop capacity within training providers to deliver necessary training to support learners\n- track and make available information regarding future outcomes related to course selections, wage outcomes, job placements, and job roles\n- present data effectively to inform decisions about SkillsFuture", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-013-S-00100", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- adopt quality and outcome metrics to assess the effectiveness of SkillsFuture-funded continuing education and training (CET) programmes\n- track and report employment outcomes via administrative data, programme-specific surveys and econometric studies\n- publish findings from econometric studies on wage premiums for graduates upgrading via Work-Study Programmes\n- administer the Work-Study Programme Outcomes Survey to evaluate employment and salary changes for work-study graduates\n- take a broader view of the impact of the SkillsFuture movement beyond wage and employment outcomes\n- publish Training Quality and Outcomes Measure (TRAQOM) survey results for learners to rate programme quality and perceived outcomes\n- study job posting data to monitor evolving job roles and skills needs in the labour market\n- publish annual Skills Demand for the Future Economy report to highlight in-demand skills in various sectors\n- provide jobs-skills tools and resources under the Jobs-Skills Portal to aid companies and training providers in skill development", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-005-S-00069", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Include higher order questions in assessments to adequately gauge students' cognitive abilities\n- Teach students how to address challenging questions within the formal education system rather than relying solely on private tuition\n- Emphasize the development of higher order thinking, problem solving, creativity, and imagination in students throughout the formal education system\n- Assess students using a combination of concepts and higher order thinking within the PSLE framework", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-005-S-00066", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- ensure PSLE contains questions of varying difficulty to accommodate students with different abilities\n- maintain that challenging questions make up approximately 15% of total marks in each subject\n- base all PSLE questions on the primary school syllabus without requiring knowledge beyond the curriculum\n- require challenging questions to apply concepts in novel or authentic contexts\n- ensure that all PSLE questions use age-appropriate language and contexts\n- structure challenging questions with scaffolding to assist students in attempting them progressively\n- support accessibility of PSLE for all students, including those without private tuition", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-006-S-00077", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- integrate collaboration and inquiry-based learning into the curriculum and syllabus of all schools\n- provide core skillsets for educators in collaboration and inquiry-based learning through training at the National Institute of Education\n- adapt collaborative learning and inquiry-based learning approaches to different subjects and varying student maturity levels\n- maintain a robust community of practice for educators to learn from other education systems, both regionally and internationally\n- continuously evaluate and improve teaching methodologies to meet the needs of individual students", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-04-T-006-S-00074", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- PSLE serves as a useful checkpoint on students' mastery of the primary school curriculum.\n- PSLE is designed to assess core concepts and skills, including the ability to think critically and apply concepts in different contexts.\n- Emphasis on nurturing students' 21st Century Competencies through co-curricular programmes, applied learning programmes, Character and Citizenship Education lessons, and leadership opportunities.\n- Support for a range of pedagogies, such as inquiry-based, collaborative, and experiential learning, to facilitate students' learning.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-05-T-013-S-00303", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support the reduction of plastic waste through community engagement and individual behaviour change\n- implement the Disposable Carrier Bag Charge to encourage reusable bag use\n- promote sustainable practices through the Packaging Partnership Programme (PPP)\n- encourage partnerships with industry and provide guidelines for sustainable e-commerce packaging\n- support ground-up initiatives for environmental sustainability through the SG Eco Fund\n- introduce the Beverage Container Return Scheme to encourage recycling of beverage containers", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-003-S-00028", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support targeted development of the SkillsFuture Credit to achieve specific outcomes\n- focus part of funding on developing lifelong learning culture\n- facilitate employment opportunity development for mid-career transitions\n- work with sector agencies and industry partners to map manpower needs and identify jobs and skills gaps\n- curate training programmes with training providers to close identified skills gaps\n- monitor the improvement of lifelong learning culture through metrics like course offerings, training providers, and SkillsFuture Credit utilisation\n- conduct research with economic agencies to ensure favourable economic outcomes related to training initiatives\n- enhance accessibility, quality, and outcomes of SSG-supported careers through policy and programme reviews", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-003-S-00025", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- impose conditions on the types of courses that the SkillsFuture Credit can be used for to meet policy intent\n- target mid-careerists aged 40 and above with the $4,000 SkillsFuture Credit (Mid-Career) top-up for curated courses with stronger employment objectives\n- use the opening SkillsFuture Credit of $500 to encourage lifelong learning and skills development across different life stages\n- ensure that eight in 10 learners find the course content relevant to their work", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-007-S-00061", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Increase the number of events related to sustainability efforts from 400 in 2023 to 1,200 in 2025.\n- Support the participation of over 400,000 individuals in sustainability events.\n- Encourage the awareness of reduce, reuse, and recycle principles.\n- Promote partnerships with schools, educational institutions, NGOs, and the private sector to engage the community in sustainability initiatives.\n- Explore the idea of calculating carbon and energy savings from events to improve sustainability efforts.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-007-S-00058", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- support national environmental sustainability initiatives like Clean and Green Singapore (CGS).\n- promote community engagement in environmental activities and events.\n- encourage participation in campaigns by National Environment Agency (NEA) such as Clean Tables and Say Yes to Waste Less.\n- advocate for the shaping of public attitudes towards environmental sustainability without the setting of specific targets.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-009-S-00077", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Engage directly with training providers to seek feedback about courses and service providers\n- Utilize multiple reporting mechanisms, including both online and digital channels, for feedback collection\n- Conduct audits to assess the quality of training and verify delivery against stated training outcomes\n- Take remedial action based on feedback to ensure courses and assessments are fit for purpose", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-11-06-T-009-S-00072", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- prohibit training providers from engaging third parties for direct marketing of courses\n- enforce strict marketing guidelines for training providers to prevent exaggerated claims and aggressive tactics\n- take enforcement actions such as suspension or termination of registration for non-compliance with SSG guidelines\n- publish a list of training providers who violate SSG's marketing guidelines\n- require training providers to publish course ratings based on learner feedback to help inform decisions\n- adjust monitoring and guidelines for training providers' marketing behaviour based on public feedback", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-007-S-00070", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Encourage students to approach schools and teachers to set up interest groups.\n- Work with grassroots leaders to provide educational programmes.\n- Ensure programmes are accessible to lifelong learners of all ages.\n- Continue to open up access to funds for students to access opportunities in and outside of the classroom.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-25-T-007-S-00067", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- provide financial support for lower-income students to access educational programmes\n- run the Junior Sports Academy Programme to help primary school students discover their sporting strengths\n- provide Opportunity Fund grants to schools for co-curricular development opportunities for low-income students\n- operate Student Care Centres in primary schools for after-school care and enrichment\n- offer subsidized fees for low-income families for Student Care Centres\n- provide out-of-school opportunities for secondary students through community partners and interest-based activities\n- integrate out-of-school experiences into post-secondary curricula via internships and industry programs\n- support additional opportunities and mentoring for students through community partnerships\n- facilitate overseas exposure opportunities with financial assistance for eligible students\n- continue to review and strengthen programmes and partnerships for affordable learning opportunities", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-05-T-017-S-00029", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- strengthen Singapore's position as a global sustainable aviation and maritime hub\n- increase transportation options for Singaporeans to meet future mobility needs\n- expand international linkages in air, sea and land transport through stronger international cooperation and strategic agreements\n- bolster Singapore's air connectivity with the operational launch of Changi Terminal 5 (T5) in the mid-2030s\n- increase Changi's annual passenger capacity by over 50% and grow city links from 170 to over 200\n- increase Singapore’s air cargo handling capacity by 80% with developments at Changi East Industrial Zone and Changi Airfreight Centre\n- develop the Changi East Urban District as a new lifestyle and business hub\n- uplift aviation careers through jobs transformation, skills upgrading and technology adoption\n- enhance sustainability in aviation with the use of sustainable aviation fuel\n- expand the Port of Singapore and increase its handling capacity to 65 million twenty-foot equivalent units with Tuas Port by the 2040s\n- support automation and AI in port operations\n- prepare the port for a low-carbon future by building expertise and infrastructure to handle alternative fuels\n- develop the Johor Bahru-Singapore Rapid Transit System (RTS) Link by December 2026 to strengthen economic ties with Malaysia\n- continue to expand the rail network under the Land Transport Master Plan\n- close the loop for the Circle Line, extend the Downtown Line and Thomson-East Coast Line, and open the new Jurong Region Line (JRL)\n- link all existing lines with the completion of the Cross Island Line\n- ensure high rail reliability standards through investments in systems and training\n- enhance bus connectivity with nearly $1 billion investment in the Bus Connectivity Enhancement Programme\n- pilot fixed-route autonomous vehicle services in Punggol and expand to more towns\n- engage the public to understand changing transport needs and build a transport system for Singaporeans\n- upgrade MRT stations and bus interchanges for easier navigation and more welcoming spaces\n- implement features like covered linkways and kerbless crossings for better accessibility", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00129", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- LTA responsible for ownership and renewal of rail assets\\n- Operators responsible for maintenance of rail assets\\n- Importance of collaboration between regulator and operator to understand system problems\\n- Improvement in rail reliability performance attributed to collaborative efforts over the last decade\\n- Continued efforts to improve communications and performance in operations\\n- Involvement of vendors in crisis management and operations for quicker response", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00120", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- acknowledge improvements in BPLRT reliability over the years\n- support systemic upgrades of the LRT's power system and trains\n- thank Mr. Liang for his suggestion regarding transport issues\n- maintain several bus services that complement the LRT\n- consider suggestions for introducing more parallel-run bus services while factoring in ridership and availability of resources", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00112", "method": "POST", "url": "/v1/embeddings", "body": {"input": "no positions found", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00114", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- set an MKBF target of one million train-kilometres between delays exceeding five minutes\n- ensure rail operators maintain appropriate rest periods for workers\n- take safety and well-being of rail transport workers seriously\n- increase transparency in performance data sharing by LTA\n- improve service recovery processes during train disruptions\n- enhance commuter information during service delays, including precise details on alternative travel routes\n- establish a centralized app for real-time updates during disruptions\n- conduct audits on maintenance and operations of critical systems\n- bring forward the renewal of critical components such as power supply and signalling for MRT lines", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00123", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Assess financial penalties for serious disruptions to public transport operators based on culpability.\n- Reduce penalties for public transport operators after considering appeals and their responsibilities in specific incidents.\n- Collaborate with public transport operators to prioritise solutions for disruptions, which may involve hardware or asset upgrades.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00132", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- observe congestion levels on the NEL and prioritize alleviating them during peak hours\n- connect the NEL to more train lines, specifically through the Cross Island Line, to improve resilience\n- augment bus network capacity along the NEL corridor as a supplementary measure\n- support workers through training regimes, focused on adapting to new technologies and systems", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00126", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Acknowledge the increase in train disruptions this year compared to last year and attribute it to the greater impact of individual disruptions.\n- Commit to more than doubling efforts to minimize train disruptions as the rail network is expanded.\n- State that it is not feasible to achieve zero train disruptions due to the growth of the rail network.\n- Emphasize the importance of measuring rail reliability with meaningful indicators beyond just counting disruptions,\n- Mention that LTA will track and publish additional performance indicators for better understanding of rail performance.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-009-S-00117", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- work closely with unions and rail operators to upgrade train maintenance systems\n- ensure workers have the right capabilities and skills for new technology\n- utilize funds to support worker training and capabilities\n- encourage rail operators to focus on training and building capabilities of workers", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-022-S-00240", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Support the continuation and refinement of the COE system despite its imperfections and unpopularity.\n- Advocate for prioritizing mass public transport over car ownership due to limited land availability in Singapore.\n- Emphasize the use of COE revenues (approximately $4 billion to $6 billion annually) to subsidize public transport and other government expenditures, benefiting society at large.\n- Argue against the implementation of subsidies or discounts on COE based on individual needs, suggesting that resources should be allocated to benefit a larger number of families.\n- Propose the use of alternative transportation credits or vouchers for families instead of COE subsidies.\n- Highlight the government's efforts to stabilize COE supply and address rising prices through measures such as injecting additional COEs into the market.\n- Stress the importance of investing in public transport infrastructure, including operational subsidies for bus and train services and enhancements for commuter accessibility. \n- Recognize the challenge of creating a fair needs-based allocation system for COEs, advocating instead for the current market mechanism as the most transparent and effective method to manage scarce resources.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-059-S-00323", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- cease the Electric Vehicle (EV) Early Adoption Incentive from 1 January 2027\n- extend the Vehicular Emissions Scheme (VES) till end-2027\n- consider EV adoption rates and upfront cost differences across powertrains when reviewing VES in the future", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-127-S-00477", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- impose UL2272 and EN15194 standards on motorised Personal Mobility Devices and Power-Assisted Bicycles to manage fire safety risks.\n- monitor the development of international fire safety standards for Personal Mobility Aids.\n- review existing guidelines on the safe storage and charging of Active Mobility Devices (AMDs).\n- step up public education efforts on fire safety tips regarding the use of AMDs.\n- educate AMD users about the risk of AMD-related fires and safe charging practices through the Be-Device-Safe programme.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-128-S-00479", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- The median EV charging price is $0.66/kWh for HDB carparks and $0.74/kWh for private commercial carparks. \n- Charging prices are determined as commercial decisions. \n- Tenders for EV chargers were evaluated on a price-quality framework with a greater emphasis on quality over price. \n- Operators do not have exclusive rights to operate in HDB carparks, allowing for future tenders to install more EV chargers.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-22-T-129-S-00481", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- prioritize installing lifts at pedestrian overhead bridges along Sengkang West Way near Block 496B to serve seniors\n- fit three other bridges along Sengkang West Way with lifts in the next phase of LTA’s lift retrofitting programme\n", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-011-S-00186", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- operate up to 40 trains along the North-East Line (NEL) during peak-hours  \n- maintain wait time between trains during peak hours at less than two minutes  \n- enhance five existing peak-hour bus services and add five new peak-hour bus services for the Northeast Region  \n- improve incentives for the Travel Smart Journeys programme to encourage commuters to shift their timing or mode of their journeys  \n- complete the Cross Island Line (CRL) Phase 1 and the CRL Punggol Extension by the early 2030s  \n- conduct feasibility studies for a new Seletar Line to provide an additional option for commuters travelling from the northeast to the city centre", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-012-S-00188", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- enforce against unlicensed foreign vehicles providing P2P services within Singapore\n- safeguard commuter safety by ensuring licensed local drivers are prioritized\n- increase penalties for illegal P2P rides to strengthen deterrence\n- push for the removal of apps, channels, and advertisements facilitating illegal P2P services\n- enhance the Cross-Border Taxi Scheme with Malaysian authorities\n- develop new options for accommodating large families with young children, the elderly, and corporate customers\n- accept phone and online bookings for taxis licensed under the existing Cross-Border Taxi Scheme for doorstep pick-ups\n- provide more earning opportunities for drivers\n- explore using location tracking, including electronic road pricing 2.0, to prevent illegal trips by cross-border taxis within Singapore", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-023-S-00211", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Require all foreign vehicles entering Singapore to have a valid Vehicle Entry Permit (VEP) and pay a daily VEP fee\n- Allow foreign workers employed as deliverymen with valid work passes to use personal foreign-registered or Singapore-registered motorcycles for their employer's trade, but not for platform work\n- Prohibit the use of foreign-registered goods vehicles for delivery services within Singapore", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-029-S-00223", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- tighten regulations for Personal Mobility Aids (PMAs) to curb misuse by able-bodied users and improve path safety\n- reduce speed limit for PMAs from 10km/h to 6km/h\n- align dimensions for PMAs with public transport standards\n- require certification of medical need to use a mobility scooter\n- table legislative amendments in Parliament by October 2025\n- implement new regulations in the first quarter of 2026\n- increase publicity efforts using infographics and educational materials regarding the changes to PMA regulations\n- engage PMA users to remind ineligible users to switch to alternative devices", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-030-S-00225", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- LTA tracks changes to pedestrian volume and implements new infrastructure as needed.\n- LTA assessed that the width of the pedestrian overhead bridge at Khatib MRT station can cope with current and projected pedestrian flow, including from Chencharu estate.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-032-S-00229", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- prioritize the safety of all road users\n- implement measures for lorries to have canopies and higher protective side railings\n- lower speed limits and enforce minimum space requirements for transportation\n- study the economic impact of disallowing workers from being ferried on the back of lorries\n- work with tripartite partners and industry associations to improve transportation safety for workers", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-051-S-00268", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- stabilize the Certificate of Entitlement (COE) supply by bringing forward COE quota from future guaranteed de-registrations\n- inject an additional up to about 20,000 COE quota since February 2025\n- encourage potential car buyers to be prudent in entering the market now", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-052-S-00270", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Introduce schemes like the Vehicular Emissions Scheme and Electric Vehicle Early Adoption Incentive to encourage cleaner-energy car adoption by narrowing the upfront cost gap with Internal Combustion Engine cars.\n- Review factors such as EV and hybrid car adoption rates and total cost of ownership when assessing the effectiveness of schemes promoting cleaner-energy vehicles.", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-055-S-00277", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Build covered linkways connecting transport infrastructure to HDB developments and POBs\n- Fully fund covered linkways and lifts for overhead bridges by the Government to encourage public transport use\n- Provide additional covered linkways if the Town Council agrees to co-fund construction, balancing convenience and fiscal prudence", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
{"custom_id": "2025-09-23-T-071-S-00311", "method": "POST", "url": "/v1/embeddings", "body": {"input": "- Align safety regulations with ICAO's guidelines on electronic devices on flights\n- Implement restrictions on the allowable capacity of lithium batteries onboard aircraft\n- Enforce regulations on how lithium batteries must be carried and limitations on their use during flight\n- Allow Singapore carriers to implement stricter safety policies for electronic devices at their discretion", "model": "text-embedding-3-small", "encoding_format": "float", "dimensions": 1536}}
